emacs/.config/emacs/custom-elisp.org
#+title: Custom Elisp
#+property: header-args:emacs-lisp  :mkdirp yes :lexical t :exports code
#+property: header-args:emacs-lisp+ :tangle custom-elisp.el
#+property: header-args:emacs-lisp+ :mkdirp yes :noweb no-export
auto_tangle: yes
* Dired Function
This function allows the user to open all marked files from dired in a new buffer.
#+begin_src emacs-lisp
(defun james/open-marked-files (&optional files)
  "Open all marked FILES in Dired buffer as new Emacs buffers."
  (interactive)
  (let* ((file-list (if files
                        (list files)
                      (if (equal major-mode "dired-mode")
                          (dired-get-marked-files)
                        (list (buffer-file-name))))))
   (mapc (lambda (file-path)
           (find-file file-path))
         (file-list))))
#+end_src
* Handle new windows
The two functions below allow the user to not only create a new window
to the right or below the current window (respectively), but also to
focus the new window immediately.
#+begin_src emacs-lisp
(defun split-window-right-and-focus ()
  "Spawn a new window right of the current one and focus it."
  (interactive)
  (split-window-right)
  (windmove-right))

(defun split-window-below-and-focus ()
  "Spawn a new window below the current one and focus it."
  (interactive)
  (split-window-below)
  (windmove-down))
#+end_src

* Resize windows
#+begin_src emacs-lisp
(with-eval-after-load 'hydra
  (defhydra windows-adjust-size ()
    "
             _j_: shrink
_h_: enlarge              _l_: right
             _k_: enlarge
"
    ("h" enlarge-window-horizontally)
    ("j" shrink-window)
    ("k" enlarge-window)
    ("l" shrink-window-horizontally)))
#+end_src

* Switch between buffers
#+begin_src emacs-lisp
(defun switch-to-messages-buffer ()
  "Switch to Messages buffer."
  (interactive)
  (switch-to-buffer (messages-buffer)))

(defun switch-to-scratch-buffer ()
  "Switch to Messages buffer."
  (interactive)
  (switch-to-buffer "*scratch*"))
#+end_src
